txtcomm = {
    'profile':              1,
    'профиль':              1,
    'стата':                1,
    'deck':                 2,
    'колода':               2,
    'дека':                 2,
    'обычная':              3,
    'ordinary':             3,
    'кки':                  4,
    'tcg':                  4,
    'card':                 5,
    'карта':                5,
    'random':               11,
    'случайная':            11,
    'рандомная':            11,
    'gate card':            12,
    'gc':                   12,
    'карта ворот':          12,
    'кв':                   12,
    'ability card':         13,
    'ability':              13,
    'карта способностей':   13,
    'абилка':               13,
    'delete':               6,
    'удалить':              6,
    'add':                  7,
    'добавить':             7,
    'sort':                 8,
    'сортировать':          8,
    'rewrite':              9,
    'picsort':              10
}


series_to_indexes = {
    "48":       '0',
    "15a":      '1',
    "48b":      '2',
    "48c":      '3',
    "48d":      '4',
    "ba":       '5',
    "18mcd":    '6',
    "48e":      '7',
    "18f":      '8',
    "18h":      '9',
    "48i":      'a',
    "18j":      'b',
    "18l":      'c',
    "48n":      'd',
    "48q":      'e',
    "48q1":     'f',
    "48ah":     'g',
    "8f":       'h',
    "4m":       'i',
    "4o":       'j',
    "3p":       'k',
    "3aa":      'l',
    "3ab":      'm',
    "4ac":      'n',
    "3ad":      'o',
    "2ab":      'p',
    "1ag":      'q',
    "4sa":      'r',
    "7sa":      's',
    "4ai":      't',
    "6":        'u',
    "3b":       'v',
    "6br":      'w',
    "5bcon":    'x',
    "6deka":    'y',
    "48a":      'z',
    "48b1":     'A',
    "48c1":     'B',
    "48d1":     'C',
    "47e":      'D',
    "6a":       'E',
    "4a":       'F',
    "2b":       'G',
    "5b":       'H',
    "4c":       'I',
    "4d":       'J',
    "4e":       'K',
    "6a1":      'L',
    "4c1":      'M',
    "4b":       'N',
    "6d":       'O',
    "4e1":      'P',
    "4s":       'Q',
    "2t":       'R',
    "1":        'S',
    "11":       'T',
    "lg":       'U'
}


indexes_to_series = {
    '0':    "48",
    '1':    "15a",
    '2':    "48b",
    '3':    "48c",
    '4':    "48d",
    '5':    "ba",
    '6':    "18mcd",
    '7':    "48e",
    '8':    "18f",
    '9':    "18h",
    'a':    "48i",
    'b':    "18j",
    'c':    "18l",
    'd':    "48n",
    'e':    "48q",
    'f':    "48q1",
    'g':    "48ah",
    'h':    "8f",
    'i':    "4m",
    'j':    "4o",
    'k':    "3p",
    'l':    "3aa",
    'm':    "3ab",
    'n':    "4ac",
    'o':    "3ad",
    'p':    "2ab",
    'q':    "1ag",
    'r':    "4sa",
    's':    "7sa",
    't':    "4ai",
    'u':    "6",
    'v':    "3b",
    'w':    "6br",
    'x':    "5bcon",
    'y':    "6deka",
    'z':    "48a",
    'A':    "48b1",
    'B':    "48c1",
    'C':    "48d1",
    'D':    "47e",
    'E':    "6a",
    'F':    "4a",
    'G':    "2b",
    'H':    "5b",
    'I':    "4c",
    'J':    "4d",
    'K':    "4e",
    'L':    "6a1",
    'M':    "4c1",
    'N':    "4b",
    'O':    "6d",
    'P':    "4e1",
    'Q':    "4s",
    'R':    "2t",
    'S':    "1",
    'T':    "11",
    'U':    "lg"
}


crdtp_num_to_cym = {
    '0': "U",
    '1': "s",
    '2': "g",
    '3': "c",
    '4': "R",
    '5': "B",
    '6': "G",
    '7': "r",
    '8': "e",
    '9': "X"
}


crdtp_cym_to_txt = {
    'U': "Неизвестная карта",
    's': "Серебряная",
    'g': "Золотая",
    'c': "Бронзовая",
    'R': "Красная",
    'B': "Синяя",
    'G': "Зелёная",
    'r': "Карта свойств",
    'e': "Карта эволюции",
    'X': "Запрещённая карта"
}


deckuse_type5_response = {
    0: "Серебряных",
    1: "Золотых",
    2: "Бронзовых",
    3: "Красных",
    4: "Синих",
    5: "Зелёных"
}


crdtp_cym_to_int = {
    'U': 0,
    's': 1,
    'g': 2,
    'c': 3,
    'R': 4,
    'B': 5,
    'G': 6,
    'r': 7,
    'e': 8,
    'X': 9
}


dtl = {
    0: "Ваша колода не подходит для игры",
    1: "Ваша колода подходит для игры по западным правилам",
    2: "Ваша колода подходит для игры по японским правилам"
}


altdeckuse = {
    0: "Это не похоже на колоду",
    1: "Ваша колода подходит для игры",
    2: "Ваша колода не подходит для игры - неверное количество карт ворот.\nИх должно быть по две каждого цвета.",
    3: "Ваша колода не подходит для игры - неверное количество карт способностей.\nИх должно быть десять штук.",
    4: "Ваша колода не подходит для игры - она содержит неподходящие карты(референс/эво/зап).\nИх там быть не должно.",
    5: "Ваша колода не подходит для игры - в ней должно быть шесть карт ворот и десять карт способностей.\n"
}


deck_templates = {
    0:  "z5AedlzogDaL|Тёмный Берсерк",
    1:  "f4ffAggsBD7K|Пайрус Монодрагоноид",
    2:  "B5AbzgBvCCBF|Певерлевел Моносабтерра",
    3:  "e4gb7jesgzeG|Аквос/хаос с Вайредом"
}
